#+Title: orgmode

* orgmode
  :PROPERTIES:
  :CATEGORY: orgmode
  :COLUMNS:  %25ITEM %1PRIORITY %10TAGS
  :ARCHIVE:  teste
  :ORDERED:  t
  :END:  
:LOGBOOK:
CLOCK: [2021-10-13 qua 11:01]--[2021-10-13 qua 11:06] =>  0:05
:END:
** code block outras linguagens
#+Name: A
| ca | cb |
| a  | b  |
|    |    |
#+begin_src sqlite :db /home/wagner/mnt/pen/fzlbpms/data/orgmode-sqlite-dbs/ctaspgar.db :var orgtable=A :colnames yes
drop table if exists A;
create table A(val1 int, val2 int);
.mode csv A
.import $orgtable A
select * from a;
#+end_src

#+RESULTS:
| val1 | val2 |
|------+------|
| a    | b    |
|      |      |

**** python code

#+NAME PYTHONCODE1
#+begin_src python
def foo(x):
  if x>0:
    return x+1

  else:
    return x-1

return foo(5)
#+end_src

#+RESULTS:
: 6

abre um buffer pra vc editar o codigo

#+begin_src python
a="asdfasdf"
print(a)
#+end_src

#+RESULTS:


#+begin_src sh :shebang "#!/bin/bash"
echo "asdf"
#+end_src

#+begin_src elisp
  (message (org-version))
#+end_src

#+RESULTS:
: 8.2.10


